## [빅데이터 분석을 위한 통계 이론]  
1. 유클리디안 거리, 코사인 유사도 및 거리에 대해 설명하시오. (코드를 예로 들어서)  
2. 표준화와 정규화에 대해 정의하고, 수식에 대해 설명하시오(코드를 예로 들어서)

In [5]:
#1-1. 유클리디안 거리
# 설명: 두 데이터간의 직선 거리이다 (피타고라스의 정리에 기반되었다.) 두 데이터간의 거리가 가까울수록 유사하다.
# 두 데이터간 각 특성의 차이의 제곱의 합의 제곱근 ((|2-1|^2 + |4-2|^2)^(1/2))이며 l2 distance라고도 합니다. 
from math import sqrt
x=[0,4,5,7]
y=[4,-3,2,9]
sqrt(sum(pow(a - b, 2) for a, b in zip(x, y)))

8.831760866327848

In [6]:
#1-2. 코사인 유사도
# 코사인 유사도는 벡터와 벡터 간의 유사도를 비교할 때 두 벡터 간의 사잇각을 구해서 얼마나 유사한지 수치로 나타낸 것입니다. 
# 벡터 방향이 비슷할수록 두 벡터는 서로 유사하며(1), 벡터 방향이 90도 일때는 두 벡터 간의 관련성이 없으며(0), 
# 벡터 방향이 반대가 될수록 두 벡터는 반대 관계를 보입니다(-1). 
import numpy as np

def cos_similarity(v1, v2):
    dot_product = np.dot(v1, v2)
    l2_norm = (np.sqrt(sum(np.square(v1))) * np.sqrt(sum(np.square(v2))))
    similarity = dot_product / l2_norm     
    
    return similarity
cos_similarity([20,30,21], [40,30,21])

0.946171297660526

In [19]:
#2. 표준화와 정규화에 대해 정의하고, 수식에 대해 설명하시오(코드를 예로 들어서) 
#표준화 (standardization): 
#데이터가 평균으로 부터 얼마나 떨어져있는지 나타내는 값잆니다.
#특정 범위를 벗어난 데이터는 이상치(outlier)로 간주합니다.
import numpy as np
from math import *
x=[0.01,0.3,1,2,3,6,8,10]
z = (x - np.mean(x))/np.std(x)
z

array([-1.07280587, -0.99047343, -0.79173996, -0.507835  , -0.22393004,
        0.62778484,  1.19559477,  1.76340469])

In [20]:
#정규화 (normalization):
#데이터의 상대적 크기에 대한 영향을 줄이기 위해 데이터의 범위를 0~1로 변환하는작업 입니다.
#MinMaxScaling 사용
nor = (x - np.min(x)) / (np.max(x) - np.min(x))
nor

array([0.        , 0.02902903, 0.0990991 , 0.1991992 , 0.2992993 ,
       0.5995996 , 0.7997998 , 1.        ])

## [파이썬 분석 및 시각화 라이브러리]   
1. 타이타닉 데이터에 대해 아래와 같은 작업을 수행하시오.  
1) Pclass를 원핫인코딩  
2) Age를 이산화(5개 구간으로 나눔)  
3) embarked를 원핫인코딩  

2. bins = [5, 20, 30, 40, 60, 90]  
labels = ["미성년자", "청년", "중년", "장년", "노년"]  
타이타닉호 승객을 사망자와 생존자 그룹으로 나누고 각 그룹에 대해 '미성년자', '청년', '중년', '장년', '노년' 승객의 비율을 구한다.  
각 그룹 별로 비율의 전체 합은 1이 되어야 한다.

In [21]:
import pandas as pd

In [24]:
df=pd.read_csv("titanic/train.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [33]:
df['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [46]:
#1-1) Pclass를 원핫인코딩 
one_hot_encoding=pd.get_dummies(df['Pclass'])
one_hot_encoding

     1  2  3
0    0  0  1
1    1  0  0
2    0  0  1
3    1  0  0
4    0  0  1
..  .. .. ..
886  0  1  0
887  1  0  0
888  0  0  1
889  1  0  0
890  0  0  1

[891 rows x 3 columns]

In [44]:
#1-2) Age를 이산화(5개 구간으로 나눔) 
df['Age'].fillna(df['Age'].mean(), inplace=True)

In [45]:
pd.cut(df['Age'], 5)

0      (16.336, 32.252]
1      (32.252, 48.168]
2      (16.336, 32.252]
3      (32.252, 48.168]
4      (32.252, 48.168]
             ...
886    (16.336, 32.252]
887    (16.336, 32.252]
888    (16.336, 32.252]
889    (16.336, 32.252]
890    (16.336, 32.252]
Name: Age, Length: 891, dtype: category
Categories (5, interval[float64]): [(0.34, 16.336] < (16.336, 32.252] < (32.252, 48.168] < (48.168, 64.084] < (64.084, 80.0]]

In [ ]:
#1-3) embarked를 원핫인코딩

In [48]:
df['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [49]:
pd.get_dummies(df['Embarked'])

     C  Q  S
0    0  0  1
1    1  0  0
2    0  0  1
3    0  0  1
4    0  0  1
..  .. .. ..
886  0  0  1
887  0  0  1
888  0  0  1
889  1  0  0
890  0  1  0

[891 rows x 3 columns]

2. bins = [5, 20, 30, 40, 60, 90]  
labels = ["미성년자", "청년", "중년", "장년", "노년"]  
타이타닉호 승객을 사망자와 생존자 그룹으로 나누고 각 그룹에 대해 '미성년자', '청년', '중년', '장년', '노년' 승객의 비율을 구한다.  
각 그룹 별로 비율의 전체 합은 1이 되어야 한다.

In [87]:
df=pd.read_csv("titanic/train.csv")

In [96]:
df['Age'].fillna(df['Age'].median(),inplace=True)

In [98]:
df['Age'] = df['Age'].astype(int)

In [115]:
df['AgeBand']=pd.cut(df['Age'], bins=[5,20,30,40,60,90], labels=['미성년자','청년','중년','장년','노년'])
ab_group = pd.DataFrame(df.groupby('Survived')['AgeBand'].value_counts())
ab_group.columns=['Counts']
ab_group['Ratio'] = round(ab_group / ab_group.sum(axis=0, level=0),2)
ab_group

                  Counts  Ratio
Survived AgeBand
0        청년          272   0.51
         중년           86   0.16
         미성년자         85   0.16
         장년           76   0.14
         노년           17   0.03
1        청년          136   0.44
         중년           69   0.22
         미성년자         51   0.16
         장년           50   0.16
         노년            5   0.02